WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
/**************************************************************************************************
 * (C) 2020 Walvoil S.p.a.                                                                            *
 * All rights reserved.                                                                           *
 **************************************************************************************************/
/* @file S32K_Can.c
 * History:
 *  - 30 gen 2020 1.0 Davoli - First release
 * S32K_can.c description
 */

/**************************************************************************************************
 *  1. PRIVATE INCLUDE FILES                                                                      *
 **************************************************************************************************/
#include "Cpu.h"
#include "S32K_CanDma.h"
#include "flexcan_hw_access.h"
#include "string.h"
#include "S32K_SysPin.h"
static flexcan_state_t s_flexcanState[CAN_INSTANCE_COUNT];
extern wres_t S32K_Can_GetRxStatus( s_S32K_can_id ObjId, wres_t *Status);
static uint32_t S32K_Can_SetInitBitRate( s_bspcan_bitRate BitRate );
//extern wres_t S32K_Can_GetBitRate( s_S32K_can_id ObjId, s_bspcan_bitRate *BitRate);
//extern wres_t S32K_Can_MsgTx( s_S32K_can_id ObjId,s_S32K_can_msg_t *msgCan );
/**************************************************************************************************
 *  2. PRIVATE DEFINES                                                                            *
 **************************************************************************************************/

//can_buff_config_t TxbuffCfg =  {
//    .enableFD = false,
//    .enableBRS = false,
//    .fdPadding = 0U,
//    .idType = CAN_MSG_ID_STD,
//    .isRemote = false
//};
//
//can_buff_config_t buffCfgSTD =  {
//    .enableFD = false,
//    .enableBRS = false,
//    .fdPadding = 0U,
//    .idType = CAN_MSG_ID_STD,
//    .isRemote = false
//};
//
//can_buff_config_t buffCfgEXT =  {
//    .enableFD = false,
//    .enableBRS = false,
//    .fdPadding = 0U,
//    .idType = CAN_MSG_ID_EXT,
//    .isRemote = false
//};

/**************************************************************************************************
 *  3. PRIVATE MACROS                                                                             *
 **************************************************************************************************/

#define RX_MAILBOX_STD   0UL  //Buffer 0 Receive Standard Id Messages
#define RX_MAILBOX_EXT   1UL  //Buffer 1 Receive Extended Id Messages

#define FIRST_RX_MAILBOX 0UL  //From Buffer 2 to All buffer defined transmit Standard and Extended Id Messages
#define FIRST_TX_MAILBOX 10UL  //From Buffer 2 to All buffer defined transmit Standard and Extended Id Messages
#define MAILBOX_NUM      16UL  //From Buffer 2 to All buffer defined transmit Standard and Extended Id Messages


#define CAN_MSG_ALL_ID_PASS 0u        //Receive Filter : Pass all ID
#define CAN_MSG_ALL_ID_PASS_TYPE 3u   //Receive Mask   : Pass all ID

#ifndef CAN_OBJ_NUM
#define S32K_CAN_OBJ_NUM 0L
#else
#define S32K_CAN_OBJ_NUM CAN_OBJ_NUM
#endif

#if CAN_OBJ_NUM > 3u
    #error Gli Oggetti Can possono essere al massimo 3
#endif

#ifdef CAN_NUM_RX_FILTER_0
#if CAN_NUM_RX_FILTER_0 > 0u
#define S32K_CAN_NUM_RX_FILTER_0 CAN_NUM_RX_FILTER_0
#else
#define S32K_CAN_NUM_RX_FILTER_0 0UL
#endif
#if CAN_RX_QUEUE_SIZE_0 > 0u
#define S32K_CAN_RX_QUEUE_SIZE_0 CAN_RX_QUEUE_SIZE_0
#else
#define S32K_CAN_RX_QUEUE_SIZE_0 1UL
#endif
#endif

#ifdef CAN_NUM_RX_FILTER_1
#if CAN_NUM_RX_FILTER_1 > 0u
#define S32K_CAN_NUM_RX_FILTER_1 CAN_NUM_RX_FILTER_1
#else
#define S32K_CAN_NUM_RX_FILTER_1 0UL
#endif
#if CAN_RX_QUEUE_SIZE_1 > 0u
#define S32K_CAN_RX_QUEUE_SIZE_1 CAN_RX_QUEUE_SIZE_1
#else
#define S32K_CAN_RX_QUEUE_SIZE_1 1UL
#endif
#endif

#ifdef CAN_NUM_RX_FILTER_2
#if CAN_NUM_RX_FILTER_2 > 0u
#define S32K_CAN_NUM_RX_FILTER_2 CAN_NUM_RX_FILTER_2
#else
#define S32K_CAN_NUM_RX_FILTER_2 0UL
#endif
#if CAN_RX_QUEUE_SIZE_2 > 0u
#define S32K_CAN_RX_QUEUE_SIZE_2 CAN_RX_QUEUE_SIZE_2
#else
#define S32K_CAN_RX_QUEUE_SIZE_2 1UL
#endif
#endif

#define S32K_CAN_RX_FILTER_NUM_0 S32K_CAN_NUM_RX_FILTER_0 + 1u
#define S32K_CAN_RX_FILTER_NUM_1 S32K_CAN_NUM_RX_FILTER_1 + 1u
#define S32K_CAN_RX_FILTER_NUM_2 S32K_CAN_NUM_RX_FILTER_2 + 1u

/**************************************************************************************************
 *  4. PRIVATE ENUMERATIONS                                                                       *
 **************************************************************************************************/


/**************************************************************************************************
 *  5. PRIVATE STRUCTURES                                                                         *
 **************************************************************************************************/
typedef struct {
    uint32_t RxId;
    uint32_t RxMask;
    s_can_msg_id_type_t IdType;
}s_S32K_can_RxFilter;

typedef struct {
    //------------------ Local -----------------------------------
    bool open;
    //------------------ Config ----------------------------------
    uint8_t instanceNum;
    //------------------ Input -----------------------------------
//    uint32_t maxBuffNum;
    Queue_t rxQueue;
    flexcan_user_config_t UserConfig;
    flexcan_state_t *State;
    //------------------ Output ----------------------------------
    flexcan_operation_modes_t Mode;
    s_bspcan_bitRate ActualbitRate;
    wres_t Rxres;
    //flexcan_msgbuff_t *p_RxMsg;
    //can_message_t *p_RxMsgEXT;
    flexcan_msgbuff_t TxMessage;
    flexcan_msgbuff_t RxMessage;
    s_S32K_can_RxFilter *p_RxFilter;
    flexcan_id_table_t  *p_Id_table;
//    uint8_t RxFilerNum;
//    bool CmdSampleTxMsg;
//    bool CmdSampleRxMsg;
//    s_SafetySample_Status StatusSampleTxMsg;
//    s_SafetySample_Status StatusSampleRxMsg;
//    s_S32K_can_msg_t *pRxSampleMsg;
//    s_S32K_can_msg_t *pTxSampleMsg;
} s_S32K_canObj;

