WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
typedef struct {
    s_S32K_canObj * CanObjPtr;
    s_S32K_can_msg_t * p_Q_rxBuffer;
    uint8_t QrxBuffsize;
    //flexcan_msgbuff_t *p_RxMsg;
    //can_message_t *p_RxMsgEXT;
    s_S32K_can_RxFilter *p_RxFilter;
    flexcan_id_table_t  *p_Id_table;
//    uint8_t RxFilerNum;
//    s_S32K_can_msg_t * pRxSampleMsg;
//    s_S32K_can_msg_t * pTxSampleMsg;
}s_S32K_can_Config;

#define RX_MAILBOX_NUM FIRST_TX_MAILBOX  //From Buffer 2 to All buffer defined transmit Standard and Extended Id Messages

/**************************************************************************************************
 *  6. PRIVATE TYPES                                                                              *
 **************************************************************************************************/

/**************************************************************************************************
 *  7. PRIVATE (STATIC) FUNCTION PROTOTYPES                                                       *
 **************************************************************************************************/
//static can_callback_t CanCallback(uint8_t instance, flexcan_event_type_t eventType, flexcan_state_t *flexcanState);
static void CanCallback(uint8_t instance, flexcan_event_type_t eventType, uint32_t buffIdx,flexcan_state_t *flexcanState);
//static uint8_t FindFreeTxBuffer(uint8_t instance );
static uint8_t FindFreeTxBuffer(uint8_t instance, uint32_t id, flexcan_state_t *state, bool checkBuffIndex, uint8_t buffIndex );

//static bool CAN_MsgRxCheckID(uint8_t ObjId, const can_message_t *msgCan, s_can_msg_id_type_t IdType );
/**************************************************************************************************
 *  8. PRIVATE (STATIC) VARIABLES                                                                 *
 **************************************************************************************************/
static flexcan_time_segment_t ActlBitrate;
#if CAN_INSTANCE_COUNT == 1u
  static uint8_t Instance_To_CanObj[CAN_INSTANCE_COUNT]={0xFFu};
#endif
#if CAN_INSTANCE_COUNT == 2u
  static uint8_t Instance_To_CanObj[CAN_INSTANCE_COUNT]={0xFFu,0xFFu};
#endif
#if CAN_INSTANCE_COUNT == 3u
  static uint8_t Instance_To_CanObj[CAN_INSTANCE_COUNT]={0xFFu,0xFFu,0xFFu};
#endif
#if S32K_CAN_OBJ_NUM == 0u
s_S32K_can_Config Can_Obj_Config[1]={
    {NULL, NULL, 0u,NULL, NULL,NULL,0u, NULL,NULL},
};
#endif

#if S32K_CAN_OBJ_NUM == 1u
can_message_t recvMsgSTD0;
can_message_t recvMsgEXT0;

s_S32K_canObj CanObj_0;
s_S32K_can_msg_t Q_CanRxBuff_0[S32K_CAN_RX_QUEUE_SIZE_0];
s_S32K_can_RxFilter RxFilter_0[S32K_CAN_RX_FILTER_NUM_0];

s_S32K_can_msg_t CanSampleRxBuffer_0;
s_S32K_can_msg_t CanSampleTxBuffer_0;

s_S32K_can_Config Can_Obj_Config[S32K_CAN_OBJ_NUM]={
    {&CanObj_0, &Q_CanRxBuff_0[0], S32K_CAN_RX_QUEUE_SIZE_0,&recvMsgSTD0,&recvMsgEXT0, &RxFilter_0[0],S32K_CAN_RX_FILTER_NUM_0,&CanSampleRxBuffer_0,&CanSampleTxBuffer_0},
};
#endif

#if S32K_CAN_OBJ_NUM == 2u
//flexcan_msgbuff_t recvMsg0;
//flexcan_msgbuff_t recvMsg1;

static s_S32K_canObj CanObj_0;
static s_S32K_canObj CanObj_1;
static s_S32K_can_msg_t Q_CanRxBuff_0[S32K_CAN_RX_QUEUE_SIZE_0];
static s_S32K_can_msg_t Q_CanRxBuff_1[S32K_CAN_RX_QUEUE_SIZE_1];

static s_S32K_can_RxFilter RxFilter_0[RX_MAILBOX_NUM];
static s_S32K_can_RxFilter RxFilter_1[RX_MAILBOX_NUM];
static flexcan_id_table_t IdTable_0[RX_MAILBOX_NUM];
static flexcan_id_table_t IdTable_1[RX_MAILBOX_NUM];

//s_S32K_can_msg_t CanSampleRxBuffer_0;
//s_S32K_can_msg_t CanSampleTxBuffer_0;
//s_S32K_can_msg_t CanSampleRxBuffer_1;
//s_S32K_can_msg_t CanSampleTxBuffer_1;

static s_S32K_can_Config Can_Obj_Config[S32K_CAN_OBJ_NUM]={
    {&CanObj_0, &Q_CanRxBuff_0[0], S32K_CAN_RX_QUEUE_SIZE_0, &RxFilter_0[0], &IdTable_0[0]},
    {&CanObj_1, &Q_CanRxBuff_1[0], S32K_CAN_RX_QUEUE_SIZE_1, &RxFilter_1[0], &IdTable_1[0]},
};
#endif

#if S32K_CAN_OBJ_NUM == 3u
can_message_t recvMsgSTD0;
can_message_t recvMsgEXT0;
can_message_t recvMsgSTD1;
can_message_t recvMsgEXT1;
can_message_t recvMsgSTD2;
can_message_t recvMsgEXT2;

s_S32K_canObj CanObj_0;
s_S32K_canObj CanObj_1;
s_S32K_canObj CanObj_2;
s_S32K_can_msg_t Q_CanRxBuff_0[S32K_CAN_RX_QUEUE_SIZE_0];
s_S32K_can_msg_t Q_CanRxBuff_1[S32K_CAN_RX_QUEUE_SIZE_1];
s_S32K_can_msg_t Q_CanRxBuff_2[S32K_CAN_RX_QUEUE_SIZE_2];

s_S32K_can_RxFilter RxFilter_0[S32K_CAN_RX_FILTER_NUM_0];
s_S32K_can_RxFilter RxFilter_1[S32K_CAN_RX_FILTER_NUM_1];
s_S32K_can_RxFilter RxFilter_2[S32K_CAN_RX_FILTER_NUM_2];

s_S32K_can_msg_t CanSampleRxBuffer_0;
s_S32K_can_msg_t CanSampleTxBuffer_0;
s_S32K_can_msg_t CanSampleRxBuffer_1;
s_S32K_can_msg_t CanSampleTxBuffer_1;
s_S32K_can_msg_t CanSampleRxBuffer_2;
s_S32K_can_msg_t CanSampleTxBuffer_2;

s_S32K_can_Config Can_Obj_Config[S32K_CAN_OBJ_NUM]={
    {&CanObj_0, &Q_CanRxBuff_0[0], S32K_CAN_RX_QUEUE_SIZE_0,&recvMsgSTD0,&recvMsgEXT0, &RxFilter_0[0],S32K_CAN_RX_FILTER_NUM_0,&CanSampleRxBuffer_0,&CanSampleTxBuffer_0},
    {&CanObj_1, &Q_CanRxBuff_1[0], S32K_CAN_RX_QUEUE_SIZE_1,&recvMsgSTD1,&recvMsgEXT1, &RxFilter_1[0],S32K_CAN_RX_FILTER_NUM_1,&CanSampleRxBuffer_1,&CanSampleTxBuffer_1},
    {&CanObj_2, &Q_CanRxBuff_2[0], S32K_CAN_RX_QUEUE_SIZE_2,&recvMsgSTD2,&recvMsgEXT2, &RxFilter_2[0],S32K_CAN_RX_FILTER_NUM_2,&CanSampleRxBuffer_2,&CanSampleTxBuffer_2},
};

#endif

#if S32K_CAN_OBJ_NUM > 3u
    #error Gli Oggetti Can possono essere al massimo 3
  #endif
/**************************************************************************************************
 *  9. PUBLIC VARIABLES                                                                           *
 **************************************************************************************************/

/**************************************************************************************************
 * 10. FUNCTION DEFINITIONS                                                                       *
 **************************************************************************************************/

