WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
// -----------------------------------------------------------------------------------------------------
static uint8_t FindFreeTxBuffer(uint8_t instance, uint32_t id, flexcan_state_t *state, bool checkBuffIndex, uint8_t buffIndex )
{
    uint8_t n;
    uint8_t Res;
    uint8_t startIndex;
    status_t status[MAILBOX_NUM-FIRST_TX_MAILBOX];
    
    Res = (uint8_t)MAILBOX_NUM;
    startIndex = FIRST_TX_MAILBOX;
    for( n = (uint8_t)FIRST_TX_MAILBOX; n <MAILBOX_NUM; n++ )
    {
        status[n-FIRST_TX_MAILBOX] = FLEXCAN_DRV_GetTransferStatus(instance,n);
        flexcan_msgbuff_t *mb_m = state->mbs[n].mb_message;
        if ( id == mb_m->msgId )
        {
            startIndex = n+1U;
        }    
    }
    if ( true == checkBuffIndex )
    {
        Res = buffIndex+FIRST_TX_MAILBOX;
        if ( STATUS_SUCCESS != status[buffIndex] )
        {
            Res = (uint8_t)MAILBOX_NUM;
        }
    }
    else
    {
        for( n=startIndex; n<MAILBOX_NUM; n++ )
        {
            if ( STATUS_SUCCESS == status[n-FIRST_TX_MAILBOX] )
            {
                Res = n;
                break;
            }
        }
    }
    
//    
//    for( n = (uint8_t)FIRST_TX_MAILBOX; n <MAILBOX_NUM; n ++ )
//    //for( n = (uint8_t)( MAILBOX_NUM - 1U ); n >=FIRST_TX_MAILBOX; n -- )
//    {
//        status = FLEXCAN_DRV_GetTransferStatus(instance,n);
//        if ( STATUS_SUCCESS != status )
//        {
//            flexcan_msgbuff_t *mb_m = state->mbs[n].mb_message;
//            if ( id == mb_m->msgId )
//            {
//                Res = n+1U;
//            }
//        }
//        else
//        {
//	    Res = n;
//	}
//    }
    return Res;
}

//// -----------------------------------------------------------------------------------------------------
//static bool CAN_MsgRxCheckID(uint8_t ObjId, const can_message_t *msgCan, s_can_msg_id_type_t IdType )
//{   
//    // Find if RxId is une of My RxId
//    uint8_t i;
//    s_S32K_canObj *Config;
//    s_can_msg_id_type_t FilterIdType;
//    Config = Can_Obj_Config[ObjId].CanObjPtr;
//
//    for( i = 0; i < RX_MAILBOX_NUM; i ++ )
//    {
//	FilterIdType = Config->p_RxFilter[i].IdType ;
//	if ( MY_CAN_MSG_ID_ALL == Config->p_RxFilter[i].IdType )
//	{
//	    FilterIdType = IdType;
//	}
//	if (( (msgCan->id & Config->p_RxFilter[i].RxMask) == Config->p_RxFilter[i].RxId )&&(IdType == FilterIdType ))
//	{
//	    return true;
//	}
//    }
//    return false;
//}

// -----------------------------------------------------------------------------------------------------
static void CanCallback(uint8_t instance, flexcan_event_type_t eventType, uint32_t buffIdx,flexcan_state_t *flexcanState)
{
//    (void)flexcanState;
//    (void)instance;
    uint8_t ObjId;
    switch(eventType)
    {
   case FLEXCAN_EVENT_RXFIFO_COMPLETE:
    ObjId = Instance_To_CanObj[instance];
    if (S32K_CAN_OBJ_NUM > ObjId)
    {
	    s_S32K_canObj *Config;
	    Config = Can_Obj_Config[ObjId].CanObjPtr;
            s_S32K_can_msg_t msgCan;
            msgCan.id  = Config->RxMessage.msgId;
            msgCan.dlc = Config->RxMessage.dataLen;
            msgCan.isRemote =false;
            msgCan.TypeID =(flexcan_msgbuff_id_type_t)((Config->RxMessage.cs & CAN_CS_IDE_MASK)>>CAN_CS_IDE_SHIFT);
            memcpy( &msgCan.data, Config->RxMessage.data, 8U );
            if (WRES_OK == Queue_Enqueue(&Config->rxQueue,&msgCan))
            {
                Config->Rxres = WRES_OK;
            }
            else
            {
                Config->Rxres = WRES_BUFFER_FULL;
            }
            FLEXCAN_DRV_RxFifo(INST_CANCOM1,&Config->RxMessage);
    }
     	break;
   case FLEXCAN_EVENT_RX_COMPLETE:
	break;
    case FLEXCAN_EVENT_TX_COMPLETE:
	break;
    default:
	break;
    }
    
 
}

// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_SetSwRxFilter(s_S32K_can_id ObjId, uint8_t FilterIndex, uint32_t PassId, s_S32K_can_FilterMask Mask, s_can_msg_id_type_t IdType )
{
    wres_t res;
    uint32_t auxMask;

    if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
    {
        s_S32K_canObj *Config;
	Config = Can_Obj_Config[ObjId].CanObjPtr;
	if (FilterIndex < RX_MAILBOX_NUM)
	{
#ifdef RX_FIFO_FORMAT_A   
                auxMask = (uint32_t)( Mask );              
                if ( true == Config->p_Id_table[FilterIndex].isExtendedFrame )
                {
                    auxMask = ( auxMask << 1U ) &  0x3FFFFFFFUL;                  
                    auxMask = auxMask | 0x40000000UL;
                }
                else
                {
                    auxMask = ( auxMask << 19U ) &  0x3FF80000UL;
                }
                if ( true == Config->p_Id_table[FilterIndex].isRemoteFrame )
                {
                    auxMask = auxMask | 0x80000000UL;
                }
#endif
#ifdef RX_FIFO_FORMAT_B
                uint32_t val1 = 0u;
                uint32_t val2 = 0u;
                if ( true == Config->p_Id_table[FilterIndex].isRemoteFrame )
                {
                    val1 = 0x80000000UL;
                    val2 = 0x00008000UL;
                }
                if ( true == Config->p_Id_table[FilterIndex].isExtendedFrame )
                {
                    val1 = val1 | 0x40000000UL;
                    val2 = val2 | 0x00004000UL;
                    val1 = val1 + ( ( ( Mask & 0x0000FFFFUL ) & 0x3FFFU ) << 16U );
                    val2 = val2 + ( ( ( ( Mask >> 16U ) & 0x0000FFFFUL ) & 0x3FFFU ) << 16U );
                }
                else
                {
                    val1 = val1 + ( ( Mask & 0x0000FFFFUL ) & 0x3FFFU );
                    val2 = val2 + ( ( ( Mask >> 16U ) & 0x0000FFFFUL ) & 0x3FFFU );
                }
                auxMask = val1 | val2;
#endif
#ifdef RX_FIFO_FORMAT_C                
                auxMask = (uint32_t)( Mask ); //mask scritta con un id per ogni byte
#endif
	    Config->p_RxFilter[FilterIndex].RxId=PassId & (uint32_t)Mask;
	    Config->p_RxFilter[FilterIndex].RxMask = (uint32_t)auxMask;
	    Config->p_RxFilter[FilterIndex].IdType=(s_can_msg_id_type_t)IdType;
	    if (0x00u == (uint32_t)Mask)
            {
              Config->p_RxFilter[FilterIndex].RxId=0u;
            } //All Pass
	    res = WRES_OK;
	}
	else
	{
	    res = WRES_ERROR_INVALID_PARAMETER;
	}
    }    
    else
    {
	res = WRES_ERROR_INVALID_MODE;
    }
    return res;
}
extern wres_t S32K_Can_UpdateHwRxFilter(s_S32K_can_id ObjId)
{
  wres_t res;
  uint8_t n;
  if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
  {
    s_S32K_canObj *Config;
    Config = Can_Obj_Config[ObjId].CanObjPtr;

    //for(n=(uint8_t)FIRST_RX_MAILBOX;n<RX_MAILBOX_NUM;n++)
    for(n=(uint8_t)FIRST_RX_MAILBOX;n<MAILBOX_NUM;n++)
    {
//    Config->p_RxFilter[n].RxId = 0;
//    Config->p_RxFilter[n].RxMask = 0;
//    Config->p_RxFilter[n].IdType = MY_CAN_MSG_ID_STD;
    //Config->p_Id_table[n].isExtendedFrame = ((uint8_t)Config->p_RxFilter[n].IdType!=0u); //originale
      Config->p_Id_table[n].isExtendedFrame = true;
    //Config->p_Id_table[n].idFilter = &Config->p_RxFilter[n].RxId;
    Config->p_Id_table[n].isRemoteFrame=false;
    }
     
    // Configure RX FIFO ID filter table elements based on filter table defined above
    MY_FLEXCAN_DRV_ConfigRxFifo(Config->instanceNum, FLEXCAN_RX_FIFO_ID_FORMAT_A, Config->p_Id_table);

    //for(n=(uint8_t)FIRST_RX_MAILBOX;n<RX_MAILBOX_NUM;n++)
    for(n=(uint8_t)FIRST_RX_MAILBOX;n<MAILBOX_NUM;n++)
    {
      FLEXCAN_DRV_SetRxIndividualMask(Config->instanceNum, FLEXCAN_MSG_ID_EXT, n, Config->p_RxFilter[n].RxMask);
    }

    
        
