WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
    res = WRES_OK;  
  }
  else
  {
      res = WRES_ERROR_INVALID_PARAMETER;
  }
  return res;
}


extern wres_t S32K_CanDma_StopRx( s_S32K_can_id ObjId)
{
  wres_t res = WRES_ERROR;
  if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
  {
    s_S32K_canObj *Config;
    Config = Can_Obj_Config[ObjId].CanObjPtr;
    res = WRES_ERROR;
    if (0x02u == Config->instanceNum) 
    {
      INT_SYS_DisableIRQ(CAN2_ORed_0_15_MB_IRQn);
      res = WRES_OK;
    }  
    if (0x01u == Config->instanceNum) 
    {
      INT_SYS_DisableIRQ(CAN1_ORed_0_15_MB_IRQn);
      res = WRES_OK;
    }  
    if (0x00u == Config->instanceNum) 
    {
      INT_SYS_DisableIRQ(CAN0_ORed_0_15_MB_IRQn);
      res = WRES_OK;
    }  
  }
  else
  {
    res = WRES_ERROR_INVALID_PARAMETER;
  }
  return res;
}
extern wres_t S32K_CanDma_StartRx( s_S32K_can_id ObjId)
{
  wres_t res = WRES_ERROR;
  if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
  {
    s_S32K_canObj *Config;
    Config = Can_Obj_Config[ObjId].CanObjPtr;

    if ( STATUS_SUCCESS == FLEXCAN_DRV_RxFifo(Config->instanceNum ,&Config->RxMessage))
    {
      if (0x02u == Config->instanceNum) 
      {
        INT_SYS_EnableIRQ(CAN2_ORed_0_15_MB_IRQn);
      }  
      if (0x01u == Config->instanceNum) 
      {
        INT_SYS_EnableIRQ(CAN1_ORed_0_15_MB_IRQn);
      }  
      if (0x00u == Config->instanceNum) 
      {
        INT_SYS_EnableIRQ(CAN0_ORed_0_15_MB_IRQn);
      }  
      res = WRES_OK;
    }
    else
    {
      res = WRES_ERROR;
    }
  }
  else
  {
    res = WRES_ERROR_INVALID_PARAMETER;
  }
  return res;
}
// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_CanDma_Init( s_S32K_can_id ObjId, uint8_t instanceNum, const flexcan_user_config_t *UsrConfig, s_bspcan_bitRate UsrBaudRate )
{
    wres_t res;
    uint8_t n;
   
  if ((S32K_CAN_OBJ_NUM > (uint8_t)ObjId) && ( instanceNum < CAN_INSTANCE_COUNT))
  {
    s_S32K_canObj *Config;
    Config = Can_Obj_Config[ObjId].CanObjPtr;
    Config->UserConfig = *UsrConfig;
    Config->instanceNum = instanceNum;
    //Config->p_RxMsg = Can_Obj_Config[ObjId].p_RxMsg;
    Config->p_RxFilter = Can_Obj_Config[ObjId].p_RxFilter;
    Config->p_Id_table = Can_Obj_Config[ObjId].p_Id_table;
    Config->State = &canCom1_State;
    Config->Mode= (flexcan_operation_modes_t)UsrConfig->flexcanMode;
    if ( WRES_OK == Queue_Init(&Config->rxQueue,Can_Obj_Config[ObjId].p_Q_rxBuffer,sizeof(s_S32K_can_msg_t),(uint32_t)Can_Obj_Config[ObjId].QrxBuffsize))
    {
      //if ( STATUS_SUCCESS == FLEXCAN_DRV_Init(instanceNum, Config->State, UsrConfig))
      if ( STATUS_SUCCESS == MyFlexCanDrvInit(instanceNum, Config->State, &Config->UserConfig, S32K_Can_SetInitBitRate(UsrBaudRate) ) )
      {
        Config->ActualbitRate = UsrBaudRate;
        Instance_To_CanObj[instanceNum]=(uint8_t)ObjId;
        FLEXCAN_DRV_InstallEventCallback(instanceNum, (flexcan_callback_t)&CanCallback, NULL);
        for(n=(uint8_t)FIRST_RX_MAILBOX;n<RX_MAILBOX_NUM;n++)
        {
        Config->p_RxFilter[n].RxId = 0x1FFFFFFFu;
        Config->p_RxFilter[n].RxMask = 0xFFFFFFFFu;
        Config->p_RxFilter[n].IdType = MY_CAN_MSG_ID_EXT;
        Config->p_Id_table[n].isExtendedFrame = true;
        Config->p_Id_table[n].idFilter = &Config->p_RxFilter[n].RxId;
        }
        //n=1;
        //Config->p_Id_table[0].isExtendedFrame = false;
        
        // Configure RX FIFO ID filter table elements based on filter table defined above
        MY_FLEXCAN_DRV_ConfigRxFifo(instanceNum, FLEXCAN_RX_FIFO_ID_FORMAT_A, Config->p_Id_table);
        // set individual masking type 
        FLEXCAN_DRV_SetRxMaskType(instanceNum, FLEXCAN_RX_MASK_INDIVIDUAL);
        // first 10 filter items are masked with RXIMR0-RXIMR9 
        //for(n=(uint8_t)FIRST_RX_MAILBOX;n<RX_MAILBOX_NUM;n++)
        for(n=(uint8_t)FIRST_RX_MAILBOX;n<MAILBOX_NUM;n++)
        {
          FLEXCAN_DRV_SetRxIndividualMask(instanceNum, FLEXCAN_MSG_ID_EXT, n, 0xFFFFFFFFu);
        }
        // rest of filter items are masked with RXFGMASK 
        FLEXCAN_DRV_SetRxFifoGlobalMask(instanceNum, FLEXCAN_MSG_ID_EXT, 0xFFFFFFFFu);
        
        S32K_CanDma_StartRx(ObjId);

        res = WRES_OK;
        
//        s_S32K_can_msg_t aTxMessage;
//        aTxMessage.id = 0xDA;
//        aTxMessage.dlc = 8;
//        aTxMessage.TypeID = FLEXCAN_MSG_ID_STD;
//        aTxMessage.isRemote = false;
//        aTxMessage.data[0]= 0;
//        aTxMessage.data[1]= 1;
//        aTxMessage.data[2]= 2;
//        aTxMessage.data[3]= 3;
//        aTxMessage.data[4]= 4;
//        aTxMessage.data[5]= 5;
//        aTxMessage.data[6]= 6;
//        aTxMessage.data[7]= 7;
//
//        res =S32K_Can_MsgTx(ObjId, &aTxMessage);

        Config->open =true;
      }
      else
      {
      res = WRES_ERROR_INVALID_MODE;
      }
      
    }
    else
    {
    res = WRES_ERROR_INVALID_PARAMETER;
    }
  }
  else
  {
    res = WRES_ERROR_INVALID_PARAMETER;
  }
  return res;         
        
//	// Configure TX buffer
//	for( n = FIRST_TX_MAILBOX; n < Config->maxBuffNum; n ++ )
//        {
//	    CAN_ConfigTxBuff((can_instance_t)instanceNum, n, &buffCfgSTD);
//	}
//	// Configure RX buffer
//	CAN_ConfigRxBuff((can_instance_t)instanceNum, RX_MAILBOX_STD, &buffCfgSTD,0x0UL);
//	CAN_ConfigRxBuff((can_instance_t)instanceNum, RX_MAILBOX_EXT, &buffCfgEXT,0x0UL);
//	CAN_SetRxFilter((can_instance_t)instanceNum,CAN_MSG_ID_STD, RX_MAILBOX_STD,0x0);
//	CAN_SetRxFilter((can_instance_t)instanceNum,CAN_MSG_ID_EXT, RX_MAILBOX_EXT,0x0);
//
//	Queue_Init(&Config->rxQueue,Can_Obj_Config[ObjId].p_Q_rxBuffer,sizeof(s_S32K_can_msg_t),Can_Obj_Config[ObjId].QrxBuffsize);
//	Config->open =true;
//	//CAN_InstallEventCallback((can_instance_t)instanceNum, (can_callback_t)&flexcan_Callback, NULL);
//
//	for( n = 0; n < RX_MAILBOX_NUM; n ++ )
//        {
//	    Config->p_RxFilter[n].RxId=0xFFFFFFFF;
//	    Config->p_RxFilter[n].RxMask=0xFFFFFFFF;
//	}
//	S32K_Can_SetSwRxFilter(ObjId, 0x00,CAN_MSG_ALL_ID_PASS,S32K_CAN_MASK_PASS_ALL,MY_CAN_MSG_ID_ALL );
//	CAN_Receive((can_instance_t)instanceNum, RX_MAILBOX_STD,Config->p_RxMsgSTD);
//	CAN_Receive((can_instance_t)instanceNum, RX_MAILBOX_EXT,Config->p_RxMsgEXT);
//	S32K_Can_GetBitRate(ObjId, &Config->ActualbitRate);
//	res = WRES_OK;
//    }
//    else
//    {
//	res = WRES_ERROR_INVALID_PARAMETER;
//    }
//    return res;
}

