WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
//// -----------------------------------------------------------------------------------------------------
//extern wres_t S32K_Can_DeInit( s_S32K_can_id ObjId)
//{
//    wres_t res;
//
//    s_S32K_canObj *Config;
//    if (S32K_CAN_OBJ_NUM > ObjId)
//    {
//	Config = Can_Obj_Config[ObjId].CanObjPtr;
//	if(STATUS_SUCCESS == CAN_Deinit((can_instance_t)Config->instanceNum))
//	{
//	    memset(Config, 0x00, sizeof(s_S32K_canObj));
//	    res = WRES_OK;
//	}
//	else
//	{
//	    res = WRES_ERROR;
//	}
//    }
//    else
//    {
//	res = WRES_ERROR_INVALID_PARAMETER;
//    }
//
//    return res;
//}
// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_MsgTx( s_S32K_can_id ObjId,s_S32K_can_msg_t *msgCan, bool checkBuffIndex, uint8_t buffIndex )
{
    wres_t res;
    s_S32K_canObj *Config;
    uint8_t BufferFree;
    uint8_t canStatus;

    if ( WRES_OK == S32K_SysPin_GetOutputPins(GPIO_OUT_CAN_STB, &canStatus) )
    {
        if ( 0x00u == canStatus )
        {
            if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
            {
	        Config = Can_Obj_Config[ObjId].CanObjPtr;
                if (false == Config->open)
                {
                    res = WRES_ERROR_INVALID_PARAMETER;
                }
                else
                {
	            Config->TxMessage.msgId = msgCan->id;
	            Config->TxMessage.dataLen = msgCan->dlc;
	            memcpy(&Config->TxMessage.data[0],&msgCan->data[0],8u);

                    flexcan_data_info_t dataInfo = 
                    {
                        .msg_id_type = (flexcan_msgbuff_id_type_t) msgCan->TypeID,
                        .data_length = Config->TxMessage.dataLen,
                        .fd_enable = false,
                        .fd_padding = 0u,
                        .enable_brs = false,
                        .is_remote = false,
                    };

                    BufferFree = FindFreeTxBuffer(Config->instanceNum, Config->TxMessage.msgId, Config->State, checkBuffIndex, buffIndex);
	            if( MAILBOX_NUM > BufferFree)
                    {
	                if (STATUS_SUCCESS != FLEXCAN_DRV_Send(Config->instanceNum,BufferFree,&dataInfo,Config->TxMessage.msgId, &Config->TxMessage.data[0]))
                        {
		            res = WRES_BUFFER_FULL;
	                }
                        else
                        {
		            res = WRES_OK;
	                }
	            }
                    else
                    {
	                res = WRES_BUFFER_FULL;
                    }
	        }
            }
            else
            {
	        res = WRES_ERROR_INVALID_PARAMETER;
            }
        }
        else
        {
            res = WRES_ERROR_NOT_READY;
        }
    }
    else
    {
        res = WRES_ERROR_INVALID_PARAMETER;
    }
        
    
    return res;
}

// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_RecvMsg(s_S32K_can_id ObjId, s_S32K_can_msg_t *msgCan)
{
    wres_t res;
    s_S32K_canObj *Config;
    
    if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
    {
	Config = Can_Obj_Config[ObjId].CanObjPtr;
        if ( true == Config->open )
        {
            if (WRES_OK == Queue_Dequeue(&Config->rxQueue,msgCan))
            {
                res = WRES_OK;
            }
            else
            {
                res = WRES_BUFFER_EMPTY;
            }
        }
        else
        {
            res = WRES_ERROR_INVALID_MODE;
        }
    }
    else
    {
        res = WRES_ERROR_INVALID_PARAMETER;
    }
    return res;
}

// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_GetRxStatus( s_S32K_can_id ObjId, wres_t *Status)
{
    wres_t res;
    s_S32K_canObj *Config;
    if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
    {
	Config = Can_Obj_Config[ObjId].CanObjPtr;
	*Status = Config->Rxres;
        res = WRES_OK;
    }
    else
    {
	res = WRES_ERROR_INVALID_PARAMETER;
    }
    return res;
}


// -----------------------------------------------------------------------------------------------------
static uint32_t S32K_Can_SetInitBitRate( s_bspcan_bitRate BitRate )
{
    uint32_t res;
    
    switch ( BitRate )
    {
    case CAN_BIT_RATE_20K:
        res = 20000UL;
	break;
    case CAN_BIT_RATE_50K:
        res = 50000UL;
	break;
    case CAN_BIT_RATE_125K:
        res = 125000UL;
	break;
    case CAN_BIT_RATE_250K:
        res = 250000UL;
	break;
    case CAN_BIT_RATE_500K:
        res = 500000UL;
	break;
    case CAN_BIT_RATE_1M:
        res = 1000000UL;
	break;
    default:
        res = 250000UL;
	break;
    }  
    
    return res;
}

// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_SetBitRate( s_S32K_can_id ObjId, s_bspcan_bitRate BitRate)
{
    wres_t res;
    s_S32K_canObj *Config;
    
    if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
    {
	Config = Can_Obj_Config[ObjId].CanObjPtr;
	switch ( BitRate )
	{
	case CAN_BIT_RATE_20K:
	    ActlBitrate.propSeg = 7u;
	    ActlBitrate.phaseSeg1 = 5u;
	    ActlBitrate.phaseSeg2 = 4u;
	    ActlBitrate.preDivider = 19u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	case CAN_BIT_RATE_50K:
	    ActlBitrate.propSeg = 7u;
	    ActlBitrate.phaseSeg1 = 5u;
	    ActlBitrate.phaseSeg2 = 4u;
	    ActlBitrate.preDivider = 7u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	case CAN_BIT_RATE_125K:
	    ActlBitrate.propSeg = 6u;
	    ActlBitrate.phaseSeg1 = 3u;
	    ActlBitrate.phaseSeg2 = 3u;
	    ActlBitrate.preDivider = 3u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	case CAN_BIT_RATE_250K:
	    ActlBitrate.propSeg = 7u;
	    ActlBitrate.phaseSeg1 = 4u;
	    ActlBitrate.phaseSeg2 = 1u;
	    ActlBitrate.preDivider = 1u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
        case CAN_BIT_RATE_500K:
   	    ActlBitrate.propSeg = 7u;
	    ActlBitrate.phaseSeg1 = 4u;
	    ActlBitrate.phaseSeg2 = 1u;
	    ActlBitrate.preDivider = 0u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	case CAN_BIT_RATE_1M:
	    ActlBitrate.propSeg = 2u;
	    ActlBitrate.phaseSeg1 = 1u;
	    ActlBitrate.phaseSeg2 = 1u;
	    ActlBitrate.preDivider = 0u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	default:
	    ActlBitrate.propSeg = 7u;
	    ActlBitrate.phaseSeg1 = 4u;
	    ActlBitrate.phaseSeg2 = 1u;
	    ActlBitrate.preDivider = 1u;
	    ActlBitrate.rJumpwidth = 1u;
	    break;
	}
	FLEXCAN_DRV_SetBitrate(Config->instanceNum, &ActlBitrate);
        Config->UserConfig.bitrate = ActlBitrate;
        S32K_Can_GetBitRate(ObjId, &Config->ActualbitRate);
        res = WRES_OK;
    }
    else
    {
	res = WRES_ERROR_INVALID_PARAMETER;
    }
    
    return res;
}

