WalvELEC/SW0280001/Sources/S32K/S32K_CanDma.c
// -----------------------------------------------------------------------------------------------------
extern wres_t S32K_Can_GetBitRate( s_S32K_can_id ObjId, s_bspcan_bitRate *BitRate)
{
    wres_t res;
    s_S32K_canObj *Config;
    uint32_t Aux;
    
    if (S32K_CAN_OBJ_NUM > (uint8_t)ObjId)
    {
	Config = Can_Obj_Config[ObjId].CanObjPtr;

	FLEXCAN_DRV_GetBitrate(Config->instanceNum, &ActlBitrate);
        Aux = ActlBitrate.propSeg + ActlBitrate.phaseSeg1 + ActlBitrate.phaseSeg2 + ActlBitrate.preDivider + ActlBitrate.rJumpwidth;
        switch ( Aux )
        {
        case 36U:
            *BitRate = CAN_BIT_RATE_20K;
            res = WRES_OK;
            break;
        case 24U:
            *BitRate = CAN_BIT_RATE_50K;
            res = WRES_OK;
            break;
        case 16U:
            *BitRate = CAN_BIT_RATE_125K;
            res = WRES_OK;
            break;
        case 14U:
            *BitRate = CAN_BIT_RATE_250K;
            res = WRES_OK;
            break;
        case 13U:
            *BitRate = CAN_BIT_RATE_500K;
            res = WRES_OK;
            break;
        case 5U:
            *BitRate = CAN_BIT_RATE_1M;
            res = WRES_OK;
            break;
        default:
            res = WRES_ERROR_INVALID_MODE;
            break;
        }
    }
    else
    {
	res = WRES_ERROR_INVALID_PARAMETER;
    }
    
    return res;
}
/**************************************************************************************************
 * EOF                                                                                            *
 **************************************************************************************************/
